In [1]:
# import the imprant libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
# read the data
data=pd.read_csv("Credit-History.csv")

In [4]:
# check the shape of the data
data.shape

(981, 14)

### Dataset has 981 rows and 14 columns

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 981 entries, 0 to 980
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         981 non-null    int64
 1   Loan_ID            981 non-null    object
 2   Gender             957 non-null    object
 3   Married            978 non-null    object
 4   Dependents         956 non-null    object
 5   Education          981 non-null    object
 6   Self_Employed      926 non-null    object
 7   ApplicantIncome    981 non-null    int64
 8   CoapplicantIncome  981 non-null    float64
 9   LoanAmount         954 non-null    float64
 10  Loan_Amount_Term   961 non-null    float64
 11  Credit_History     902 non-null    float64
 12  Property_Area      981 non-null    object
 13  Loan_Status        614 non-null    object
dtypes: float64(4), int64(2), object(8)
memory usage: 107.4+ KB

In [6]:
#Those persons don't have any loan amount, means zero loan amount
zero_loan_amount=data.loc[data['LoanAmount'].isna()]
zero_loan_amount.head()

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
35,35,LP001106,Male,Yes,0,Graduate,No,2275,2067.0,NaN,360.0,1.0,Urban,Y
63,63,LP001213,Male,Yes,1,Graduate,No,4945,0.0,NaN,360.0,0.0,Rural,N
81,81,LP001266,Male,Yes,1,Graduate,Yes,2395,0.0,NaN,360.0,1.0,Semiurban,Y
95,95,LP001326,Male,No,0,Graduate,NaN,6782,0.0,NaN,360.0,NaN,Urban,N

In [8]:
#Those persons doesn't have credit histroy
no_credit_history=data.loc[data['Credit_History'].isna()]
no_credit_history.head()

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
16,16,LP001034,Male,No,1,Not Graduate,No,3596,0.0,100.0,240.0,NaN,Urban,Y
24,24,LP001052,Male,Yes,1,Graduate,NaN,3717,2925.0,151.0,360.0,NaN,Semiurban,N
30,30,LP001091,Male,Yes,1,Graduate,NaN,4166,3369.0,201.0,360.0,NaN,Urban,N
42,42,LP001123,Male,Yes,0,Graduate,No,2400,0.0,75.0,360.0,NaN,Urban,Y
79,79,LP001264,Male,Yes,3+,Not Graduate,Yes,3333,2166.0,130.0,360.0,NaN,Semiurban,Y

In [9]:
#Those people doesn't have both loan amount and credit history
data.loc[(data['LoanAmount'].isna()) & (data['Credit_History'].isna())]

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
95,95,LP001326,Male,No,0,Graduate,NaN,6782,0.0,NaN,360.0,NaN,Urban,N

In [14]:
#Drop the rows(persons) if there is no Loan amount and no credit history because we cannot predict credit history of this person
data=data.dropna(subset=['LoanAmount', 'Credit_History'], how='all')

In [15]:
#If loan amount is 1 or greater we changed the loan status to 'Y' means Yes, considering their loas status is yes
#NaN values are replaced with Y.
data1=data['Loan_Status'] = np.where(data['LoanAmount'] >= 1, 'Y', data['LoanAmount'])

In [16]:
#Mostly values at the end of Loan status column were NaN but their Loan Amount is mentioned, now we can see it replaced by 'Y' 
data.tail()

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
976,362,LP002971,Male,Yes,3+,Not Graduate,Yes,4009,1777.0,113.0,360.0,1.0,Urban,Y
977,363,LP002975,Male,Yes,0,Graduate,No,4158,709.0,115.0,360.0,1.0,Urban,Y
978,364,LP002980,Male,No,0,Graduate,No,3250,1993.0,126.0,360.0,NaN,Semiurban,Y
979,365,LP002986,Male,Yes,0,Graduate,No,5000,2393.0,158.0,360.0,1.0,Rural,Y
980,366,LP002989,Male,No,0,Graduate,Yes,9200,0.0,98.0,180.0,1.0,Rural,Y

In [17]:
#check nan values in the column 'Loan_Status'
nan_loan_status=data.loc[data['Loan_Status'] == 'nan']

In [18]:
#There are 26 persons found which has nan value in Loan_Status and Loan Amount column 
nan_loan_status

,Unnamed: 0,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,nan
35,35,LP001106,Male,Yes,0,Graduate,No,2275,2067.0,NaN,360.0,1.0,Urban,nan
63,63,LP001213,Male,Yes,1,Graduate,No,4945,0.0,NaN,360.0,0.0,Rural,nan
81,81,LP001266,Male,Yes,1,Graduate,Yes,2395,0.0,NaN,360.0,1.0,Semiurban,nan
102,102,LP001350,Male,Yes,NaN,Graduate,No,13650,0.0,NaN,360.0,1.0,Urban,nan
103,103,LP001356,Male,Yes,0,Graduate,No,4652,3583.0,NaN,360.0,1.0,Semiurban,nan
113,113,LP001392,Female,No,1,Graduate,Yes,7451,0.0,NaN,360.0,1.0,Semiurban,nan
127,127,LP001449,Male,No,0,Graduate,No,3865,1640.0,NaN,360.0,1.0,Rural,nan
202,202,LP001682,Male,Yes,3+,Not Graduate,No,3992,0.0,NaN,180.0,1.0,Urban,nan
284,284,LP001922,Male,Yes,0,Graduate,No,20667,0.0,NaN,360.0,1.0,Rural,nan
305,305,LP001990,Male,No,0,Not Graduate,No,2000,0.0,NaN,360.0,1.0,Urban,nan
322,322,LP002054,Male,Yes,2,Not Graduate,No,3601,1590.0,NaN,360.0,1.0,Rural,nan
338,338,LP002113,Female,No,3+,Not Graduate,No,1830,0.0,NaN,360.0,0.0,Urban,nan
387,387,LP002243,Male,Yes,0,Not Graduate,No,3010,3136.0,NaN,360.0,0.0,Urban,nan
435,435,LP002393,Female,NaN,NaN,Graduate,No,10047,0.0,NaN,240.0,1.0,Semiurban,nan
437,437,LP002401,Male,Yes,0,Graduate,No,2213,1125.0,NaN,360.0,1.0,Urban,nan
479,479,LP002533,Male,Yes,2,Graduate,No,2947,1603.0,NaN,360.0,1.0,Urban,nan
524,524,LP002697,Male,No,0,Graduate,No,4680,2087.0,NaN,360.0,1.0,Semiurban,nan
550,550,LP002778,Male,Yes,2,Graduate,Yes,6633,0.0,NaN,360.0,0.0,Rural,nan
551,551,LP002784,Male,Yes,1,Not Graduate,No,2492,2375.0,NaN,360.0,1.0,Rural,nan
605,605,LP002960,Male,Yes,0,Not Graduate,No,2400,3800.0,NaN,180.0,1.0,Urban,nan
692,78,LP001415,Male,Yes,1,Graduate,No,3413,4053.0,NaN,360.0,1.0,Semiurban,nan
715,101,LP001542,Female,Yes,0,Graduate,No,2262,0.0,NaN,480.0,0.0,Semiurban,nan
802,188,LP002057,Male,Yes,0,Not Graduate,No,13083,0.0,NaN,360.0,1.0,Rural,nan
861,247,LP002360,Male,Yes,NaN,Graduate,No,10000,0.0,NaN,360.0,1.0,Urban,nan
903,289,LP002593,Male,Yes,1,Graduate,No,8333,4000.0,NaN,360.0,1.0,Urban,nan

In [19]:
#Drop those 26 persons which has nan value in Loan_Status and Loan Amount column
dt=data.drop(data[data['Loan_Status'] == 'nan'].index, inplace=True)

In [21]:
# Fill NaN of all integer with 0. Above we can see 3 columns which has dtype int has NaN
data=data.fillna({"Dependents":0, 'Loan_Amount_Term':0, 'Credit_History': 0})

In [22]:
#still 2 columns 'Gender' and 'Self_Employed' has NaN value but it doesn't really effect the analysis of credit history 
data.isna().sum()

Unnamed: 0            0
Loan_ID               0
Gender               24
Married               2
Dependents            0
Education             0
Self_Employed        54
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History        0
Property_Area         0
Loan_Status           0
dtype: int64

In [23]:
# checking the numarical data 
data.describe()

,Unnamed: 0,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,954.000000,954.000000,954.000000,954.000000,954.000000,954.000000
mean,260.284067,5163.429769,1614.696981,142.511530,334.901468,0.768344
std,165.310049,5726.839191,2745.041621,77.421743,81.115160,0.422112
min,0.000000,0.000000,0.000000,9.000000,0.000000,0.000000
25%,124.000000,2875.250000,0.000000,100.000000,360.000000,1.000000
50%,244.500000,3788.500000,1123.000000,126.000000,360.000000,1.000000
75%,366.750000,5500.000000,2366.500000,162.000000,360.000000,1.000000
max,613.000000,81000.000000,41667.000000,700.000000,480.000000,1.000000

In [24]:
#code